<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Comment</key>
        <string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
        <key>Description</key>
        <string>Downloads the latest version of Twine 2 and imports it into Munki.</string>
        <key>Identifier</key>
        <string>com.github.denmoff.munki.Twine2</string>
        <key>Input</key>
        <dict>
                <key>MUNKI_REPO_SUBDIR</key>
                <string>apps/%NAME%</string>
                <key>NAME</key>
                <string>Twine</string>
                <key>pkginfo</key>
                <dict>
                        <key>catalogs</key>
                        <array>
                                <string>testing</string>
                        </array>
                        <key>description</key>
                        <string>Twine is an open-source tool for telling interactive, nonlinear stories.</string>
                        <key>developer</key>
                        <string>Leon Arnott</string>
                        <key>display_name</key>
                        <string>Twine 2</string>
                        <key>name</key>
                        <string>%NAME%</string>
                        <key>unattended_install</key>
                        <true/>
                </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>ParentRecipe</key>
        <string>com.github.denmoff.download.Twine2</string>
        <key>Process</key>
        <array>
                <dict>
                        <key>Processor</key>
                        <string>MunkiImporter</string>
                        <key>Arguments</key>
                        <dict>
                                <key>pkg_path</key>
                                <string>%pathname%</string>
                                <key>repo_subdirectory</key>
                                <string>%MUNKI_REPO_SUBDIR%</string>
                        </dict>
                </dict>
        </array>
</dict>
</plist>
