<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Twine 2.</string>
        <key>Identifier</key>
        <string>com.github.denmoff.download.Twine2</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Twine 2</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>asset_regex</key>
                    <string>^twine_2.*?_macos.dmg$</string>
                    <key>github_repo</key>
                    <string>klembot/twinejs</string>
                    <key>sort_by_highest_tag_names</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%url%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/*.app</string>
                    <key>requirement</key>
                    <string>identifier "com.electron.twine" and anchor apple generic and certificate leaf[subject.CN] = "Apple Development: Chris Klimas (F6R2D4DKZE)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
